Revit 2027 API
BuiltInFailures.SelectionFailures.NoValidElementSelected Property
 No valid element selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoValidElementSelected { get; }
Public Shared ReadOnly Property NoValidElementSelected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoValidElementSelected {
	FailureDefinitionId^ get ();
}
static member NoValidElementSelected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SelectionFailures Class
Autodesk.Revit.DB Namespace